gferreiratfmc/dpmu/dpmu_cpu2/dpmu_cpu2.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "F2838x" --package "337bga" --part "F2838x_337bga" --context "CPU1" --product "C2000WARE@4.02.00.00"
 * @versions {"tool":"1.17.0+3128"}
 */

/**
 * Import the modules used in this configuration.
 */
const adc              = scripting.addModule("/driverlib/adc.js", {}, false);
const adc1             = adc.addInstance();
const adc2             = adc.addInstance();
const adc3             = adc.addInstance();
const adc4             = adc.addInstance();
const cputimer         = scripting.addModule("/driverlib/cputimer.js", {}, false);
const cputimer1        = cputimer.addInstance();
const epwm             = scripting.addModule("/driverlib/epwm.js", {}, false);
const epwm1            = epwm.addInstance();
const epwm2            = epwm.addInstance();
const epwm3            = epwm.addInstance();
const epwm4            = epwm.addInstance();
const epwm5            = epwm.addInstance();
const epwm6            = epwm.addInstance();
const epwm7            = epwm.addInstance();
const epwm8            = epwm.addInstance();
const gpio             = scripting.addModule("/driverlib/gpio.js", {}, false);
const gpio1            = gpio.addInstance();
const gpio2            = gpio.addInstance();
const gpio3            = gpio.addInstance();
const gpio4            = gpio.addInstance();
const gpio5            = gpio.addInstance();
const gpio6            = gpio.addInstance();
const gpio7            = gpio.addInstance();
const gpio8            = gpio.addInstance();
const gpio9            = gpio.addInstance();
const gpio10           = gpio.addInstance();
const gpio11           = gpio.addInstance();
const gpio12           = gpio.addInstance();
const gpio13           = gpio.addInstance();
const gpio14           = gpio.addInstance();
const gpio15           = gpio.addInstance();
const gpio16           = gpio.addInstance();
const gpio17           = gpio.addInstance();
const gpio18           = gpio.addInstance();
const gpio19           = gpio.addInstance();
const gpio20           = gpio.addInstance();
const gpio21           = gpio.addInstance();
const gpio22           = gpio.addInstance();
const gpio23           = gpio.addInstance();
const gpio24           = gpio.addInstance();
const inputxbar_input  = scripting.addModule("/driverlib/inputxbar_input.js", {}, false);
const inputxbar_input1 = inputxbar_input.addInstance();
const inputxbar_input2 = inputxbar_input.addInstance();
const inputxbar_input3 = inputxbar_input.addInstance();
const memcfg           = scripting.addModule("/driverlib/memcfg.js");

/**
 * Write custom configuration values to the imported modules.
 */
adc1.$name                          = "ADCINA";
adc1.interruptPulseMode             = "ADC_PULSE_END_OF_CONV";
adc1.adcResolutionMode              = "ADC_RESOLUTION_16BIT";
adc1.soc0UseCalculatedSampleTime    = true;
adc1.soc0InputCapacitance           = 1000;
adc1.soc0InputResistance            = 120;
adc1.adcClockPrescaler              = "ADC_CLK_DIV_2_0";
adc1.soc0SampleWindow               = 29;
adc1.adcSignalMode                  = "ADC_MODE_DIFFERENTIAL";
adc1.soc0Channel                    = "ADC_CH_ADCIN2_ADCIN3";
adc1.soc1Channel                    = "ADC_CH_ADCIN4_ADCIN5";
adc1.soc1SampleWindow               = 29;
adc1.registerInterrupts             = ["2"];
adc1.enabledInts                    = ["ADC_INT_NUMBER2"];
adc1.soc2Channel                    = "ADC_CH_ADCIN0_ADCIN1";
adc1.soc2SampleWindow               = 29;
adc1.enableInterrupt2               = true;
adc1.interrupt2SOCSource            = "ADC_SOC_NUMBER2";
adc1.soc0Trigger                    = "ADC_TRIGGER_EPWM12_SOCA";
adc1.soc2Trigger                    = "ADC_TRIGGER_EPWM12_SOCA";
adc1.enableInterrupt2ContinuousMode = true;
adc1.enabledSOCs                    = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1"];
adc1.enableBurstMode                = true;
adc1.burstTrigger                   = "ADC_TRIGGER_EPWM12_SOCA";
adc1.burstSize                      = 1;
adc1.soc1Trigger                    = "ADC_TRIGGER_EPWM12_SOCA";
adc1.adcInt2.enableInterrupt        = true;

adc2.adcBase                 = "ADCB_BASE";
adc2.$name                   = "ADCINB";
adc2.soc0Channel             = "ADC_CH_ADCIN4";
adc2.soc0Trigger             = "ADC_TRIGGER_EPWM11_SOCA";
adc2.interruptCycleOffset    = 1;
adc2.enableInterrupt1        = true;
adc2.adcClockPrescaler       = "ADC_CLK_DIV_2_0";
adc2.soc2Trigger             = "ADC_TRIGGER_EPWM12_SOCA";
adc2.soc3Channel             = "ADC_CH_ADCIN5";
adc2.soc3Trigger             = "ADC_TRIGGER_EPWM12_SOCA";
adc2.soc4Channel             = "ADC_CH_ADCIN1";
adc2.interruptPulseMode      = "ADC_PULSE_END_OF_CONV";
adc2.soc2SampleWindow        = 15;
adc2.soc3SampleWindow        = 25;
adc2.enabledSOCs             = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1"];
adc2.interrupt1SOCSource     = "ADC_SOC_NUMBER1";
adc2.soc1SampleWindow        = 15;
adc2.soc0SampleWindow        = 15;
adc2.enabledInts             = ["ADC_INT_NUMBER4"];
adc2.enableInterrupt4        = true;
adc2.adcResolutionMode       = "ADC_RESOLUTION_16BIT";
adc2.burstTrigger            = "ADC_TRIGGER_EPWM11_SOCA";
adc2.burstSize               = 1;
adc2.interrupt4SOCSource     = "ADC_SOC_NUMBER1";
adc2.soc1Trigger             = "ADC_TRIGGER_EPWM11_SOCA";
adc2.socHighPriorityMode     = "ADC_PRI_SOC0_HIPRI";
adc2.registerInterrupts      = ["4"];
adc2.adcInt4.enableInterrupt = true;

adc3.adcBase                 = "ADCD_BASE";
adc3.$name                   = "ADCIND";
adc3.adcClockPrescaler       = "ADC_CLK_DIV_2_0";
adc3.soc0SampleWindow        = 15;
adc3.soc1SampleWindow        = 15;
adc3.soc4Channel             = "ADC_CH_ADCIN3";
adc3.soc4Trigger             = "ADC_TRIGGER_EPWM12_SOCA";
adc3.soc4SampleWindow        = 20;
adc3.soc5Channel             = "ADC_CH_ADCIN5";
adc3.soc5Trigger             = "ADC_TRIGGER_EPWM12_SOCA";
adc3.soc5SampleWindow        = 20;
adc3.interrupt1SOCSource     = "ADC_SOC_NUMBER1";
adc3.enableInterrupt1        = true;
adc3.soc2SampleWindow        = 15;
adc3.soc3SampleWindow        = 15;
adc3.soc5Name                = "SOC5_I_DABZ3f";
adc3.soc4Name                = "SOC4_I_DABZ2f";
adc3.enabledSOCs             = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1","ADC_SOC_NUMBER2","ADC_SOC_NUMBER3"];
adc3.enableInterrupt3        = true;
adc3.soc1Channel             = "ADC_CH_ADCIN1";
adc3.soc2Name                = "SOC2_IDAB2f";
adc3.soc2Channel             = "ADC_CH_ADCIN2";
adc3.soc3Channel             = "ADC_CH_ADCIN4";
adc3.adcResolutionMode       = "ADC_RESOLUTION_16BIT";
adc3.soc3Name                = "SOC3_IDAB3f";
adc3.interruptPulseMode      = "ADC_PULSE_END_OF_CONV";
adc3.enableInterrupt2        = true;
adc3.burstTrigger            = "ADC_TRIGGER_EPWM12_SOCA";
adc3.interrupt4SOCSource     = "ADC_SOC_NUMBER3";
adc3.registerInterrupts      = ["3"];
adc3.enabledInts             = ["ADC_INT_NUMBER3"];
adc3.interrupt3SOCSource     = "ADC_SOC_NUMBER3";
adc3.burstSize               = 3;
adc3.soc0Trigger             = "ADC_TRIGGER_EPWM12_SOCA";
adc3.enableBurstMode         = true;
adc3.soc1Trigger             = "ADC_TRIGGER_EPWM12_SOCA";
adc3.soc2Trigger             = "ADC_TRIGGER_EPWM12_SOCA";
adc3.soc3Trigger             = "ADC_TRIGGER_EPWM12_SOCA";
adc3.soc1Name                = "SOC1_V_Upf";
adc3.soc0Name                = "SOC0_V_DOWNf";
adc3.socHighPriorityMode     = "ADC_PRI_THRU_SOC1_HIPRI";
adc3.adcInt3.enableInterrupt = true;

adc4.$name                          = "ADCINC";
adc4.adcBase                        = "ADCC_BASE";
adc4.soc0Channel                    = "ADC_CH_ADCIN4";
adc4.soc1Channel                    = "ADC_CH_ADCIN5";
adc4.soc1Trigger                    = "ADC_TRIGGER_EPWM12_SOCA";
adc4.soc1SampleWindow               = 5;
adc4.interruptPulseMode             = "ADC_PULSE_END_OF_CONV";
adc4.enableInterrupt1               = true;
adc4.enabledInts                    = ["ADC_INT_NUMBER1"];
adc4.enabledSOCs                    = ["ADC_SOC_NUMBER0"];
adc4.soc0SampleWindow               = 15;
adc4.socHighPriorityMode            = "ADC_PRI_SOC0_HIPRI";
adc4.adcClockPrescaler              = "ADC_CLK_DIV_2_0";
adc4.adcResolutionMode              = "ADC_RESOLUTION_16BIT";
adc4.enableInterrupt1ContinuousMode = true;
adc4.soc0Trigger                    = "ADC_TRIGGER_EPWM12_SOCB";
adc4.registerInterrupts             = ["1"];
adc4.adcInt1.enableInterrupt        = true;

cputimer1.cputimerBase             = "CPUTIMER2_BASE";
cputimer1.timerPrescaler           = 1000;
cputimer1.timerPeriod              = 200;
cputimer1.registerInterrupts       = true;
cputimer1.startTimer               = true;
cputimer1.enableInterrupt          = true;
cputimer1.$name                    = "myCPUTIMER2";
cputimer1.timerInt.enableInterrupt = true;

epwm1.$name                                                               = "BEG_1_2";
epwm1.epwmTimebase_emulationMode                                          = "EPWM_EMULATION_FREE_RUN";
epwm1.epwmTimebase_period                                                 = 714;
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_ZERO               = "EPWM_AQ_OUTPUT_HIGH";
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA            = "EPWM_AQ_OUTPUT_LOW";
epwm1.epwmDeadband_polarityFED                                            = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm1.epwmDeadband_delayRED                                               = 10;
epwm1.epwmDeadband_delayFED                                               = 10;
epwm1.epwmTimebase_hsClockDiv                                             = "EPWM_HSCLOCK_DIVIDER_1";
epwm1.epwmEventTrigger_EPWM_SOC_A_triggerEnable                           = true;
epwm1.epwmEventTrigger_EPWM_SOC_A_triggerSource                           = "EPWM_SOC_TBCTR_ZERO";
epwm1.epwmEventTrigger_EPWM_SOC_B_triggerEnable                           = true;
epwm1.epwmEventTrigger_EPWM_SOC_B_triggerSource                           = "EPWM_SOC_TBCTR_U_CMPA";
epwm1.epwmDeadband_enableRED                                              = true;
epwm1.epwmDeadband_enableFED                                              = true;
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_A_shadowMode                     = true;
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_A_shadowEvent                    = "EPWM_AQ_LOAD_ON_CNTR_PERIOD";
epwm1.epwmTimebase_syncInPulseSource                                      = "EPWM_SYNC_IN_PULSE_SRC_DISABLE";
epwm1.epwmTimebase_syncOutPulseMode                                       = ["EPWM_SYNC_OUT_PULSE_ON_CNTR_ZERO"];
epwm1.hrpwm_syncSource                                                    = "HRPWM_PWMSYNC_SOURCE_ZERO";
epwm1.epwmDigitalCompare_EPWM_TZ_DC_OUTPUT_A2                             = "EPWM_TZ_EVENT_DCXH_LOW";
epwm1.epwmDigitalCompare_EPWM_DC_MODULE_A_EPWM_DC_EVENT_1_latchMode       = "EPWM_DC_CBC_LATCH_ENABLED";
epwm1.epwmDigitalCompare_EPWM_DC_MODULE_A_EPWM_DC_EVENT_1_latchClearEvent = "EPWM_DC_CBC_LATCH_CLR_ON_CNTR_PERIOD";
epwm1.epwmDigitalCompare_EPWM_DC_MODULE_A_EPWM_DC_EVENT_2_latchMode       = "EPWM_DC_CBC_LATCH_ENABLED";
epwm1.epwmDigitalCompare_EPWM_DC_MODULE_A_EPWM_DC_EVENT_2_latchClearEvent = "EPWM_DC_CBC_LATCH_CLR_ON_CNTR_PERIOD";
epwm1.epwmDigitalCompare_EPWM_DC_MODULE_B_EPWM_DC_EVENT_1_latchMode       = "EPWM_DC_CBC_LATCH_ENABLED";
epwm1.epwmDigitalCompare_EPWM_DC_MODULE_B_EPWM_DC_EVENT_2_latchMode       = "EPWM_DC_CBC_LATCH_ENABLED";
epwm1.epwmEventTrigger_EPWM_SOC_A_triggerEventPrescalar                   = "2";
epwm1.epwmEventTrigger_EPWM_SOC_A_triggerEventCountInitEnable             = true;
epwm1.epwmEventTrigger_EPWM_SOC_B_triggerEventPrescalar                   = "2";
epwm1.epwmEventTrigger_EPWM_SOC_B_triggerEventCountInitEnable             = true;
epwm1.epwmCounterCompare_cmpB                                             = 2000;
epwm1.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZA                               = "EPWM_TZ_ACTION_LOW";
epwm1.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZB                               = "EPWM_TZ_ACTION_LOW";
epwm1.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCAEVT1                           = "EPWM_TZ_ACTION_DISABLE";
epwm1.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCAEVT2                           = "EPWM_TZ_ACTION_DISABLE";
epwm1.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCBEVT1                           = "EPWM_TZ_ACTION_DISABLE";
epwm1.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCBEVT2                           = "EPWM_TZ_ACTION_DISABLE";
epwm1.epwmActionQualifier_continousSwForceReloadMode                      = "EPWM_AQ_SW_IMMEDIATE_LOAD";
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_ZERO               = "EPWM_AQ_OUTPUT_LOW";
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_B_shadowMode                     = true;
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_B_shadowEvent                    = "EPWM_AQ_LOAD_ON_CNTR_PERIOD";
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_UP_CMPA            = "EPWM_AQ_OUTPUT_HIGH";
epwm1.epwmCounterCompare_cmpA                                             = 1;
epwm1.epwm.$assign                                                        = "EPWM11";
epwm1.epwm.epwmaPin.$assign                                               = "GPIO20";
epwm1.epwm.epwmbPin.$assign                                               = "GPIO21";

epwm2.$name                                                    = "QABPWM_12_13";
epwm2.epwmTimebase_emulationMode                               = "EPWM_EMULATION_FREE_RUN";
epwm2.epwmTimebase_hsClockDiv                                  = "EPWM_HSCLOCK_DIVIDER_1";
epwm2.epwmTimebase_period                                      = 386;
epwm2.epwmTimebase_phaseEnable                                 = true;
epwm2.epwmTimebase_forceSyncPulse                              = true;
epwm2.epwmTimebase_syncInPulseSource                           = "EPWM_SYNC_IN_PULSE_SRC_DISABLE";
epwm2.epwmCounterCompare_cmpA                                  = 193;
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_ZERO    = "EPWM_AQ_OUTPUT_HIGH";
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA = "EPWM_AQ_OUTPUT_LOW";
epwm2.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZA                    = "EPWM_TZ_ACTION_LOW";
epwm2.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZB                    = "EPWM_TZ_ACTION_LOW";
epwm2.epwmDeadband_polarityFED                                 = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm2.epwmDeadband_enableRED                                   = true;
epwm2.epwmDeadband_delayRED                                    = 4;
epwm2.epwmDeadband_enableFED                                   = true;
epwm2.epwmDeadband_delayFED                                    = 4;
epwm2.epwmTimebase_counterMode                                 = "EPWM_COUNTER_MODE_UP";
epwm2.epwmTimebase_syncOutPulseMode                            = ["EPWM_SYNC_OUT_PULSE_ON_CNTR_ZERO"];
epwm2.hrpwm_syncSource                                         = "HRPWM_PWMSYNC_SOURCE_ZERO";
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_ZERO    = "EPWM_AQ_OUTPUT_LOW";
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_UP_CMPA = "EPWM_AQ_OUTPUT_HIGH";
epwm2.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCAEVT1                = "EPWM_TZ_ACTION_DISABLE";
epwm2.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCAEVT2                = "EPWM_TZ_ACTION_DISABLE";
epwm2.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCBEVT1                = "EPWM_TZ_ACTION_DISABLE";
epwm2.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCBEVT2                = "EPWM_TZ_ACTION_DISABLE";
epwm2.epwm.$assign                                             = "EPWM6";
epwm2.epwm.epwmaPin.$assign                                    = "GPIO10";
epwm2.epwm.epwmbPin.$assign                                    = "GPIO11";

