gferreiratfmc/dpmu/dpmu_cpu2/dpmu_cpu2.syscfg
epwm6.$name                                                    = "InrushCurrentLimit";
epwm6.copyFrom                                                 = "BEG_1_2";
epwm6.epwmTimebase_hsClockDiv                                  = "EPWM_HSCLOCK_DIVIDER_1";
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_ZERO    = "EPWM_AQ_OUTPUT_HIGH";
epwm6.epwmEventTrigger_EPWM_SOC_A_triggerEnable                = true;
epwm6.epwmEventTrigger_EPWM_SOC_A_triggerSource                = "EPWM_SOC_TBCTR_ZERO";
epwm6.epwmTimebase_period                                      = 10000;
epwm6.epwmCounterCompare_cmpC                                  = 8500;
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_UP_CMPA = "EPWM_AQ_OUTPUT_LOW";
epwm6.epwmDeadband_inputRED                                    = "EPWM_DB_INPUT_EPWMB";
epwm6.epwmDeadband_inputFED                                    = "EPWM_DB_INPUT_EPWMB";
epwm6.epwmEventTrigger_EPWM_SOC_A_triggerEventPrescalar        = "1";
epwm6.epwmEventTrigger_EPWM_SOC_B_triggerEnable                = true;
epwm6.epwmEventTrigger_EPWM_SOC_B_triggerSource                = "EPWM_SOC_TBCTR_U_CMPC";
epwm6.epwmEventTrigger_EPWM_SOC_B_triggerEventPrescalar        = "1";
epwm6.epwmTimebase_counterValue                                = 1;
epwm6.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCAEVT1                = "EPWM_TZ_ACTION_DISABLE";
epwm6.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCAEVT2                = "EPWM_TZ_ACTION_DISABLE";
epwm6.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCBEVT1                = "EPWM_TZ_ACTION_DISABLE";
epwm6.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCBEVT2                = "EPWM_TZ_ACTION_DISABLE";
epwm6.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZA                    = "EPWM_TZ_ACTION_LOW";
epwm6.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZB                    = "EPWM_TZ_ACTION_LOW";
epwm6.epwm.$assign                                             = "EPWM12";
epwm6.epwm.epwmaPin.$assign                                    = "GPIO22";
epwm6.epwm.epwmbPin.$assign                                    = "GPIO168";

epwm7.$name                                             = "EPWMTimer";
epwm7.epwmTimebase_hsClockDiv                           = "EPWM_HSCLOCK_DIVIDER_1";
epwm7.epwmTimebase_period                               = 1000;
epwm7.epwmTimebase_periodLink                           = "EPWM_LINK_WITH_EPWM_11";
epwm7.epwmTimebase_forceSyncPulse                       = true;
epwm7.epwmTimebase_syncInPulseSource                    = "EPWM_SYNC_IN_PULSE_SRC_SYNCOUT_EPWM11";
epwm7.epwmCounterCompare_cmpA                           = 800;
epwm7.epwmCounterCompare_cmpBLink                       = "EPWM_LINK_WITH_EPWM_11";
epwm7.epwmCounterCompare_cmpCLink                       = "EPWM_LINK_WITH_EPWM_11";
epwm7.epwmCounterCompare_cmpDLink                       = "EPWM_LINK_WITH_EPWM_11";
epwm7.epwmEventTrigger_enableInterrupt                  = true;
epwm7.epwmEventTrigger_EPWM_SOC_A_triggerEnable         = true;
epwm7.epwmEventTrigger_EPWM_SOC_A_triggerSource         = "EPWM_SOC_TBCTR_U_CMPA";
epwm7.epwmEventTrigger_EPWM_SOC_B_triggerEnable         = true;
epwm7.epwmEventTrigger_EPWM_SOC_B_triggerSource         = "EPWM_SOC_TBCTR_ZERO";
epwm7.epwmEventTrigger_EPWM_SOC_A_triggerEventPrescalar = "15";
epwm7.epwmEventTrigger_EPWM_SOC_B_triggerEventPrescalar = "15";
epwm7.epwm.$assign                                      = "EPWM16";

epwm8.$name                                                    = "GLOAD_4_3";
epwm8.epwmDeadband_inputRED                                    = "EPWM_DB_INPUT_EPWMB";
epwm8.epwmDeadband_inputFED                                    = "EPWM_DB_INPUT_DB_RED";
epwm8.epwmTimebase_emulationMode                               = "EPWM_EMULATION_FREE_RUN";
epwm8.epwmTimebase_hsClockDiv                                  = "EPWM_HSCLOCK_DIVIDER_1";
epwm8.epwmTimebase_counterValue                                = 1;
epwm8.epwmTimebase_syncInPulseSource                           = "EPWM_SYNC_IN_PULSE_SRC_DISABLE";
epwm8.epwmTimebase_syncOutPulseMode                            = ["EPWM_SYNC_OUT_PULSE_ON_CNTR_ZERO"];
epwm8.hrpwm_syncSource                                         = "HRPWM_PWMSYNC_SOURCE_ZERO";
epwm8.epwmActionQualifier_EPWM_AQ_OUTPUT_A_shadowMode          = true;
epwm8.epwmActionQualifier_EPWM_AQ_OUTPUT_A_shadowEvent         = "EPWM_AQ_LOAD_ON_CNTR_PERIOD";
epwm8.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_ZERO    = "EPWM_AQ_OUTPUT_HIGH";
epwm8.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA = "EPWM_AQ_OUTPUT_LOW";
epwm8.epwmActionQualifier_EPWM_AQ_OUTPUT_B_shadowMode          = true;
epwm8.epwmActionQualifier_EPWM_AQ_OUTPUT_B_shadowEvent         = "EPWM_AQ_LOAD_ON_CNTR_PERIOD";
epwm8.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_ZERO    = "EPWM_AQ_OUTPUT_HIGH";
epwm8.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_UP_CMPB = "EPWM_AQ_OUTPUT_LOW";
epwm8.epwmCounterCompare_cmpA                                  = 10001;
epwm8.epwmCounterCompare_cmpB                                  = 10001;
epwm8.epwmTripZone_registerInterrupts                          = true;
epwm8.epwmActionQualifier_continousSwForceReloadMode           = "EPWM_AQ_SW_IMMEDIATE_LOAD";
epwm8.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZA                    = "EPWM_TZ_ACTION_DISABLE";
epwm8.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZB                    = "EPWM_TZ_ACTION_DISABLE";
epwm8.epwmTripZone_oneShotSource                               = ["EPWM_TZ_SIGNAL_OSHT1"];
epwm8.epwmTripZone_tzInterruptSource                           = ["EPWM_TZ_INTERRUPT_OST"];
epwm8.epwmTimebase_period                                      = 10;
epwm8.epwm.$assign                                             = "EPWM9";
epwm8.epwm.epwmaPin.$assign                                    = "GPIO161";
epwm8.epwm.epwmbPin.$assign                                    = "GPIO162";
epwm8.epwmTZInt.enableInterrupt                                = true;

gpio1.masterCore      = "GPIO_CORE_CPU2";
gpio1.$name           = "eFuseVin";
gpio1.gpioPin.$assign = "GPIO8";

