gferreiratfmc/dpmu/dpmu_cpu2/dpmu_cpu2.syscfg
gpio2.$name           = "HC_24V_EN";
gpio2.gpioPin.$assign = "GPIO25";

gpio3.$name           = "ENABLE_24V";
gpio3.gpioPin.$assign = "GPIO84";

gpio4.$name           = "GCMD0";
gpio4.direction       = "GPIO_DIR_MODE_OUT";
gpio4.masterCore      = "GPIO_CORE_CPU2";
gpio4.gpioPin.$assign = "GPIO97";

gpio5.$name           = "GCMD1";
gpio5.direction       = "GPIO_DIR_MODE_OUT";
gpio5.masterCore      = "GPIO_CORE_CPU2";
gpio5.gpioPin.$assign = "GPIO124";

gpio6.$name           = "GCMD2";
gpio6.direction       = "GPIO_DIR_MODE_OUT";
gpio6.masterCore      = "GPIO_CORE_CPU2";
gpio6.gpioPin.$assign = "GPIO128";

gpio7.$name           = "GCMD3";
gpio7.direction       = "GPIO_DIR_MODE_OUT";
gpio7.masterCore      = "GPIO_CORE_CPU2";
gpio7.gpioPin.$assign = "GPIO137";

gpio8.$name           = "GCMD4";
gpio8.direction       = "GPIO_DIR_MODE_OUT";
gpio8.masterCore      = "GPIO_CORE_CPU2";
gpio8.gpioPin.$assign = "GPIO138";

gpio9.$name           = "GCMD5";
gpio9.direction       = "GPIO_DIR_MODE_OUT";
gpio9.masterCore      = "GPIO_CORE_CPU2";
gpio9.gpioPin.$assign = "GPIO139";

gpio10.$name           = "GCMD6";
gpio10.direction       = "GPIO_DIR_MODE_OUT";
gpio10.masterCore      = "GPIO_CORE_CPU2";
gpio10.gpioPin.$assign = "GPIO140";

gpio11.$name             = "GCMD7";
gpio11.direction         = "GPIO_DIR_MODE_OUT";
gpio11.writeInitialValue = true;
gpio11.initialValue      = 1;
gpio11.masterCore        = "GPIO_CORE_CPU2";
gpio11.gpioPin.$assign   = "GPIO142";

gpio12.$name           = "SPARE_H1";
gpio12.masterCore      = "GPIO_CORE_CPU2";
gpio12.gpioPin.$assign = "GPIO100";

gpio13.$name           = "SPARE_C5";
gpio13.gpioPin.$assign = "GPIO165";

gpio14.$name                     = "eFuseBB";
gpio14.useInterrupt              = true;
gpio14.masterCore                = "GPIO_CORE_CPU2";
gpio14.gpioPin.$assign           = "GPIO166";
gpio14.xint.enableInt            = true;
gpio14.xint.registerInterrupts   = true;
gpio14.xint.xintNum              = "GPIO_INT_XINT5";
gpio14.xint.xInt.enableInterrupt = true;

gpio15.$name           = "GLOAD_2";
gpio15.direction       = "GPIO_DIR_MODE_OUT";
gpio15.masterCore      = "GPIO_CORE_CPU2";
gpio15.gpioPin.$assign = "GPIO167";

gpio16.$name             = "N_OE_POL";
gpio16.direction         = "GPIO_DIR_MODE_OUT";
gpio16.writeInitialValue = true;
gpio16.initialValue      = 1;
gpio16.masterCore        = "GPIO_CORE_CPU2";
gpio16.gpioPin.$assign   = "GPIO132";

gpio17.$name           = "N_LE_POL_0";
gpio17.direction       = "GPIO_DIR_MODE_OUT";
gpio17.masterCore      = "GPIO_CORE_CPU2";
gpio17.gpioPin.$assign = "GPIO133";

gpio18.$name           = "N_LE_POL_1";
gpio18.direction       = "GPIO_DIR_MODE_OUT";
gpio18.masterCore      = "GPIO_CORE_CPU2";
gpio18.gpioPin.$assign = "GPIO134";

gpio19.$name           = "Testpin";
gpio19.direction       = "GPIO_DIR_MODE_OUT";
gpio19.masterCore      = "GPIO_CORE_CPU2";
gpio19.gpioPin.$assign = "GPIO9";

gpio20.$name           = "GLOAD_1";
gpio20.direction       = "GPIO_DIR_MODE_OUT";
gpio20.masterCore      = "GPIO_CORE_CPU2";
gpio20.gpioPin.$assign = "GPIO163";

gpio21.$name           = "GCMD8";
gpio21.masterCore      = "GPIO_CORE_CPU2";
gpio21.direction       = "GPIO_DIR_MODE_OUT";
gpio21.gpioPin.$assign = "GPIO146";

gpio22.$name           = "TEST_SYNC";
gpio22.gpioPin.$assign = "GPIO141";

gpio23.$name           = "LED2";
gpio23.masterCore      = "GPIO_CORE_CPU2";
gpio23.gpioPin.$assign = "GPIO2";

gpio24.$name           = "LED1";
gpio24.gpioPin.$assign = "GPIO3";

inputxbar_input1.inputxbarGpio = "GPIO8";
inputxbar_input1.inputxbarLock = true;
inputxbar_input1.$name         = "EFUSE_VIN_TRIP1";

inputxbar_input2.$name          = "Trip2";
inputxbar_input2.inputxbarInput = "XBAR_INPUT2";
inputxbar_input2.inputxbarGpio  = "GPIO2";

inputxbar_input3.inputxbarGpio = "GPIO166";
inputxbar_input3.$name         = "EFUSE_BB_TRIP3";
inputxbar_input3.inputxbarLock = true;
gpio14.xint.inputxbar          = inputxbar_input3;

memcfg.config_MEMCFG_SECT_GS1 = "MEMCFG_GSRAMMASTER_CPU2";
memcfg.config_MEMCFG_SECT_GS3 = "MEMCFG_GSRAMMASTER_CPU2";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
epwm7.epwm.epwmaPin.$suggestSolution = "GPIO143";
epwm7.epwm.epwmbPin.$suggestSolution = "GPIO144";
